lib/tasks/dev.rake

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."description" = ? AND "mining_types"."acronym" = ? LIMIT ?  [["description", "Proof of Work"], ["acronym", "PoW"], ["LIMIT", 1]]
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://en.bitcoin.it/w/images/en/5/50/Bitcoin.png"], ["LIMIT", 1]]
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
    show_spinner("Cadastrando moedas...") do
      coins = [
              {
                description: "Bitcoin",
                acronym: "BTC",
                url_image: "https://en.bitcoin.it/w/images/en/5/50/Bitcoin.png",
                mining_type: MiningType.find_by(acronym: 'PoW')
              },
              {
                description: "Ethereum",
                acronym: "ETH",
                url_image: "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/ETHEREUM-YOUTUBE-PROFILE-PIC.png/600px-ETHEREUM-YOUTUBE-PROFILE-PIC.png",
                mining_type: MiningType.all.sample
              },
              {
                description: "DASH",
                acronym: "DASH",
                url_image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT374qF2MqvES4S5fRxxh3NrQjQr-qZOIoyQT-4Yf4UyjcRB3r6&s",
                mining_type: MiningType.all.sample
              }
              ]
      coins.each do |coin|
        Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2020-01-20 19:34:21.645270"], ["updated_at", "2020-01-20 19:34:21.645270"]]
---
  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do
      mining_types = [
        {description: "Proof of Work", acronym: "PoW"},
        {description: "Proof of Stake", acronym: "PoS"},
        {description: "Proof of Capacity", acronym: "PoC"}
        ]

      mining_types.each do |mining_type|
        MiningType.find_or_create_by!(mining_type)