app/controllers/coins_controller.rb

SELECT "coins".* FROM "coins"
---
  def index
    @coins = Coin.all

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", ""], ["created_at", "2019-12-26 16:01:54.192084"], ["updated_at", "2019-12-26 16:01:54.192084"]]
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "mining_type_id" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["mining_type_id", 2], ["updated_at", "2020-01-20 19:54:21.844833"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

SELECT "mining_types".* FROM "mining_types"
---
    def set_mining_type_options
      @mining_type_options = MiningType.all.collect {|m| [m.description, m.id] }

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_coin
      @coin = Coin.find(params[:id])